---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SpotElevTopValue
source: html/8a06fec9-2f94-c5aa-3bf6-fa3cbe63fbf0.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SpotElevTopValue Property

"Top Coordinate"

## Syntax (C#)
```csharp
public static ForgeTypeId SpotElevTopValue { get; }
```